<template>
  <div class="notice">
    <van-nav-bar title="消息通知" left-text="返回" left-arrow @click-left="onClickLeft" />
    <van-collapse v-model="activeName" accordion v-for="item in list" :key="item.name">
      <!-- <van-collapse-item title="标题1" name="1">内容</van-collapse-item>
      <van-collapse-item title="标题2" name="2">内容</van-collapse-item>
      <van-collapse-item title="标题3" name="3">内容</van-collapse-item>-->
      <template>
        <van-collapse-item :title="item.title" :name="item.name">{{item.content}}</van-collapse-item>
      </template>
    </van-collapse>
  </div>
</template>
<script>
export default {
  name: "notice",
  data() {
    return {
      activeName: "0",
      list: [
        {
          title: "高温来袭，准备好了吗？",
          name: "1",
          content:
            "高温来袭，准备好了吗？芒种已过，仲夏时节正式开始，高温天气频发，湿度大多闷热。6月份，无论是南方还是北方，都有出现35℃以上高温天气的可能，黄淮地区、西北地区东部可能出现40℃以上的高温天。"
        },
        {
          title: "晚上睡前，长期躺着“看手机”有什么危害？可能有3个“变化”！",
          name: "2",
          content: `晚上睡前，长期躺着“看手机”有什么危害？可能有3个“变化”！1、伤害眼睛长时间看手机会伤害到我们的眼睛，这是一种必然的结果，尤其是长时间躺着看手机，如果房间里将灯关掉的话，手机亮光更容易对我们的眼睛造成严重的伤害，长期下去你的视力就会降低，可能严重的还会患上青光眼造成失明。
            2、降低睡眠质量几乎所有的人晚上睡觉之前都习惯性地躺在床上，看一会儿手机再睡觉，觉得这是一种更好的放松方式。其实在网上看手机的这个过程当中，时间就会不自觉的流失掉，所以很多人都会熬夜看手机，时间长了熬夜就会影响到睡眠质量，导致大脑兴奋过度难以入睡引起失眠，不利于身体健康。
3、伤害皮肤手机中多多少少都含有电磁辐射，而且电磁辐射会加速细胞死亡，抑制新细胞的生成，影响身体健康，尤其是在玩手机的时候，手机又对着我们的脸部，更容易伤害到脸部的皮肤，容易导致脸上长出色斑，甚至皮肤过敏等症状。加上长期熬夜，也容易长出黑眼圈，影响面容。`
        },
        {
          title: "雨季安全注意事项提醒",
          name: "3",
          content: `雨季安全注意事项提醒:一，出门要披一件外套，因为一下雨就会天气变凉，所以要拿一件外套，这样就不会因为下雨而感冒。二，包里要放一把晴雨两用伞，这样防晒、下雨都能用。三，每天看天气预报，随时增减衣服，开窗通风、晒衣服。四，多吃一些除湿的食物，对身体很有好处。例如薏米、丝瓜和木瓜。五，遇到雷雨天气不要在外面接打电话，不要在大树底下躲雨，以免雷击。六，雨季来临，可以买一双雨鞋，以备需要。这样可以保护双脚、双腿不被雨水所侵犯，造成皮肤病。七，外出一定注意安全，尽量做公交或地铁，少开车出行。上班要提前走，注意路上的积水和井盖。如果开车要控制车速，慎用紧急制动。`
        },
        {
          title: "换季易得流感怎么办？教你预防流感五大“口诀”！",
          name: "4",
          content: `换季易得流感怎么办？教你预防流感五大“口诀”！防流感小妙招
面对如此凶猛来袭的流感病毒，我们该如何严防死守呢？作为坚守在健康战线的“幸存者”，在这里帮大家支点招：
招数一：预防流感记好五大口诀
尽量少去人员密集的公共场所，以防止交叉感染。
照顾和接触发热的家人、朋友时，佩戴口罩。
注意休息，多饮水。
如果您是一名流感患者，为了避免传染给周围的人，建议您定期开窗、通风。
要在流感季节前1～2个月注射流感疫苗。
招数二：防流感试试中医小药方
防治流感的药物很多，但疗效常不尽如人意。一是感冒病毒种类较多，二是病毒种类易于发生变异，一种特效药物应市不久，就因感冒病毒毒种变异而失效。若采用中药防治，疗效较好，不会因毒种变异而失效，也不会产生耐药性。
几则常用小妙招

1.艾叶、贯众各10克~20克（视房间大小而定），燃烧，以烟熏而消毒居室，每日1次，连续3天。

2.10％大蒜液滴鼻，每日3次~5次，每次2滴，连续3天。

3.野菊花或鱼腥草或蒲公英30克，水煎含漱或喷润咽喉，每日3次~5次，连续3天。

4.连须葱白3根，豆豉10克，加清水适量水煎取汁饮服，每日1剂，连续3天。

5.生姜10片，连须葱5根，水煎取汁泡脚，每日1次~2次，连续3天。

6.中成药板蓝根颗粒，每次1袋，每日2次冲饮，或中成药蒲地蓝口服液，每次1支，每日2次口服，连续3天。`
        }
      ]
    };
  },
  methods: {
    //返回
    onClickLeft() {
      this.$router.go(-1);
    }
  }
};
</script>
<style lang="less" scoped>
.notice {
  padding-bottom: 1rem;
  /deep/.van-cell__title,
  .van-cell__value {
    width: 90%;
    span {
      overflow: hidden;
      text-overflow: ellipsis;
      white-space: nowrap;
      width: 100%;
    }
  }
}
</style>