<template>
  <div class="sj">
    <van-nav-bar :title="list.ypName" left-text="返回" left-arrow @click-left="onClickLeft" />
    <div class="main">
      <img :src="list.imgSrc" alt />
      <ul style="margin-bottom:1rem">
        <li>
          <span>药品名称 :</span>
          {{list.ypName}}
        </li>
        <li>
          <span>性状 ：</span>
          {{list.xz}}
        </li>
        <li>
          <span>用法用量 ：</span>
          {{list.yf}}
        </li>
        <li>
          <span>成份 ：</span>
          {{list.cf}}
        </li>
        <li>
          <span>治疗疾病 ：</span>
          {{list.zljb}}
        </li>
        <li>
          <span>药物相互作用 ：</span>
          {{list.zljb}}
        </li>
        <li>
          <span>注意事项 ：</span>
          {{list.zysx}}
        </li>
        <li>
          <p style="font-size:0.25rem;color:#aaa;text-align:center">本页面信息仅供参考，请以产品实际附带说明书为准。</p>
        </li>
      </ul>
    </div>
  </div>
</template>
<script>
export default {
  name: "sj",
  data() {
    return {
      sjlist:this.list,
      list: [
        {
          imgSrc: "static/img/yp1.jpg",
          ypName: "玉屏风颗粒",
          xz: "本品为棕褐色颗粒。味甜、微苦。",
          yf: "开水冲服，一次5克，一日3次。",
          cf: "黄芪、防风、白术(炒).辅料为甘露醇、糊精、甜菊素、枸 橼酸。",
          zljb: "过敏性鼻炎,感冒,慢性荨麻疹,流行性感冒,小儿感冒,慢性阻塞性肺病",
          ywxhzy:
            "如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。",
          zysx:
            "1.忌油腻食物。2.本品宜饭前服用。3.按照用法用量服用，小儿、孕妇、高血压、糖尿病患者应在医师指导下服用。4.服药二周或服药期间症状无明显改善，或症状加重者，应立即停药并去医院就诊。5.对本品过敏者禁用，过敏体质者慎用。6.本品性状发生改变时禁止使用。7.儿童必须在成人监护下使用。8.请将本品放在儿童不能接触的地方。9.如正在使用其他药品，使用本品前请咨询医师或药师。"
        },
        {
          imgSrc: "static/img/yp2.jpg",
          ypName: "999感冒灵颗粒",
          xz: "本品为浅棕色至深棕色的颗粒，味甜、微苦",
          yf: "开水冲服，一次1袋，一日3次。小儿减量或遵医嘱。",
          cf:
            "三叉苦、岗梅、金盏银盘、薄荷油、野菊花、马来酸氯苯那敏、咖啡因、对乙酰氨基酚。辅料为蔗糖粉。",
          zljb:
            "解热镇痛功效，用于因感冒引起的头痛，发热，鼻塞，流涕，咽痛等症状",
          ywxhzy:
            "如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。",
          zysx:
            "1.忌烟，酒及辛辣，生冷，油腻食物。2.不宜在服药期间同时服用滋补性中成药3. 高血压、心脏病、肝病、肾病等慢性病严重者应在医师指导下服用。4.本品含对乙氨基酚，马来酸氨苯那敏，咖啡因。服用本品期间不得饮酒或含有酒精的饮料；不能同时服用与本品成分相似的其它抗感冒药；肝，肾功能不全者慎用；膀胱颈梗阻，甲状腺功能亢进，青光眼，高血压和前列腺肥大者慎用；孕妇及哺乳期妇女慎用；服药期间不得驾驶机，车，船，从事高空作业，机械作业及操作精密仪器。5.脾胃虚寒，症见腹痛，喜暖，泄泻者慎用。6.糖尿病患者、消化道溃疡患者、膀胱颈梗阻、幽门十二指肠梗阻、甲状腺机能亢进、青光眼以及前列腺肥大等患者慎用。7.儿童，年老体弱者应在医师指导下使用。8.服药3天后症状无改善，或症状加重，或出现新的严重症状如胸闷，心悸等应立即停药，并去医院就诊。9.对本药过敏者禁用，过敏体质者慎用。10. 本品性状发生改变时禁止使用。11.儿童必须在成人监护下使用。12.请将本品放在儿童不能接触的地方。13.如正在使用其他药品，使用本品前请咨询医师或药师.14.三九感冒灵颗粒是复方药，里面含有中西药成分，不宜和西药感冒药同服。如果两种药中含有同一种成分，就只能选择服用其中一种，以免使摄入药量加倍，增加毒性，成为重复用药 [3]  。比如，三九感冒灵颗粒和西药泰诺，都含有解热镇痛效果的“扑热息痛”成分，若是两种药一起吃，过量的“扑热息痛”会对人体肝脏造成损害。"
        },
        {
          imgSrc: "static/img/yp3.jpg",
          ypName: "复方感冒灵片",
          xz: "本品为薄膜衣片，除去薄膜衣片后，显棕褐色至棕黑色；味苦。",
          yf: "口服，一次2片，一日3次，两天为一疗程。",
          cf:
            "本品为复方制剂，金银花、五指柑、野菊花、三叉苦、南板蓝根、岗梅、对乙酰氨基酚、马来酸氯苯那敏、咖啡因。辅料为：淀粉、糊精、甘露醇、羟丙纤维素、羧甲淀粉钠、硬脂酸镁、聚维酮K30、薄膜包衣预混剂。",
          zljb:
            "辛凉解表，清热解毒。用于风热感冒之发热，微恶风寒，头身痛，口干而渴，鼻塞涕浊，咽喉红肿疼痛，咳嗽，痰黄粘稠。",
          ywxhzy:
            "如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。",
          zysx: `1.忌烟、酒及辛辣、生冷、油腻食物。
2.不宜在服药期间同时服用滋补性中药。
3.风寒感冒者不适用，其表现为恶寒重，发热轻，无汗，头痛，鼻塞，流清涕，喉痒咳嗽。
4.本品含对乙酰氨基酚、马来酸氯苯那敏、咖啡因。服用本品期间不得饮酒或含有酒精的饮料；不能同时服用与本品成份相似的其他抗感冒药；肝、肾功能不全者慎用；膀胱颈梗阻、甲状腺功能亢进、青光眼、高血压和前列腺肥大者慎用；孕妇及哺乳期妇女慎用；服药期间不得驾驶机、车、船、从事高空作业、机械作业及操作精密仪器。
5.心脏病、糖尿病等慢性病严重者应在医师指导下服用。
6.严格按用法用量服用，儿童、年老体弱者应在医师指导下服用。
7.服药2天症状无缓解，应去医院就诊。
8.对本品过敏者禁用，过敏体质者慎用。
9.本品性状发生改变时禁止使用。
10.儿童必须在成人监护下使用。
11.请将本品放在儿童不能接触的地方。
12.如正在使用其他药品，使用本品前请咨询医师或药师。`
        }
      ]
    };
  },
  created(){
    console.log(this.$route.fullPath.split('?')[1])
      this.list=this.list[this.$route.fullPath.split('?')[1]]
      console.log(this.list)
  },
  methods: {
    //返回
    onClickLeft() {
      this.$router.go(-1);
    }
  }
};
</script>
<style lang="less" scoped>
.sj {
  font-size: 0.3rem;
  .main {
    img{
      width: 100%;
      height: 5rem;
      display: block;
    }
    ul {
      li {
        padding: 0.2rem;
        span {
          color: red;
        }
      }
    }
  }
}
</style>